{
  "afghanistan ": " Diplomatic relations were established on May 4, 1935, when William H. Hornibrook presented his credentials to the Afghan government. Hornibrook also was accredited to Persia and was resident at Tehran. ",
  "albania ": " Diplomatic relations were established on December 4, 1922, when Envoy Extraordinary and Minister Plenipotentiary Ulysses Grant-Smith presented credentials to the government of Albania in Tirana. ",
  "algeria ": " Diplomatic relations and the American Embassy at Algiers were established on September 29, 1962, when Algerian agreed to the elevation of the American Consulate General to Embassy status, with William J. Porter as Chargé d’Affaires ad interim. ",
  "andorra ": " The United States established diplomatic relations with Andorra on February 21, 1995, with an exchange of letters between the Andorran government (requesting to establish full diplomatic relations) and the U.S. Secretary of State. Secretary of State Warren Christopher reciprocated by appointing the U.S. Consul General in Barcelona to also represent the United States to Andorra for diplomatic and consular affairs. The first U.S. Ambassador to Andorra, Edward L. Romero, presented his credentials on October 30, 1998. All Ambassadors to Andorra have also been accredited to Spain and resident in Madrid. ",
  "angola ": "S. Liaison Office Established at Luanda, 1992. The U.S. Liaison Office in Luanda was opened January 10, 1992, with Jeffrey Millington as Director. ",
  "antigua-barbuda ": " Johns, 1981. The United States established diplomatic relations with Antigua and Barbuda on November 1, 1981. Paul Byrnes was Principal Officer when the Consulate General in St. Johns was raised to Embassy status. Ambassador Milan D. Bish presented credentials on January 8, 1982 and was resident at Bridgetown, Barbados. ",
  "argentina ": " Diplomatic relations were established on December 27, 1823, when American Minister Plenipotentiary Caesar Rodney presented his credentials to the Government of Buenos Ayres. ",
  "armenia ": " Diplomatic relations were established on December 25, 1991, when President George H.W. Bush announced the decision in an address to the nation regarding the dissolution of the Soviet Union. ",
  "australia": " On January 8, 1940, the Governments of the United States and Australia announced the establishment of bilateral diplomatic relations.",
  "austria ": " A Treaty Establishing Friendly Relations was signed between the Republic of Austria and the United States Government in Vienna on August 24, 1921. It was proclaimed to be in effect on November 8, 1921. ",
  "austrian-empire ": " Henry A. Muhlenberg was appointed as the first U.S. Minister to Austria on February 8, 1838. He presented his credentials on November 7, 1838. ",
  "azerbaijan ": " Diplomatic relations were established on February 19, 1992, when President George H.W. Bush announced the decision in a press statement. ",
  "baden ": " The relationship between the United States and the Grand Duchy of Baden continued to expand through the 1860s. On July 19, 1868, specially accredited U.S. Minister to the Grand Duke of Baden George Bancroft and the Minister of Foreign Affairs of the Grand Duchy of Baden Rudolph von Freydorf signed a treaty of naturalization between the United States and the Grand Duchy of Baden. At the time, Bancroft was also accredited to Prussia and the North German Confederation and, after 1871, to the German Empire. Yet, although Bancroft was recalled from his position in Berlin in 1874 (at his own request), he was never officially recalled from the court of Baden. For several years after Bancroft’s death in 1891, he remained listed as U.S. Minister to Baden. See entry on German Unification for further details. ",
  "bahamas ": " Diplomatic relations and the American Embassy in Nassau were established July 10, 1973, with Moncrieff J. Spear as Chargé d’Affaires ad interim. ",
  "bahrain ": " Embassy Manama was opened on September 21, 1971, with John N. Gatch, Jr. as Chargé d’Affaires ad interim. Ambassador William A. Soltzfus, Jr. presented credentials to the government of Bahrain on February 17, 1972 and was resident at Kuwait for the duration of his posting. ",
  "bangladesh": " Diplomatic relations and the American Embassy at Dhaka were established on May 18, 1972, with Herbert D. Spivack as Chargé d’Affaires ad interim. The first Ambassador Extraordinary and Plenipotentiary was Davis Eugene Boster, who presented his credentials on April 13, 1974.",
  "barbados ": " The U.S. Embassy at Bridgetown was established on November 30, 1966, with George Dolgin as Chargé d’Affaires ad interim. ",
  "bavaria ": " The relationship between the United States and the Kingdom of Bavaria continued to expand through the 1860s. On May 26, 1868, specially accredited U.S. Minister Plenipotentiary George Bancroft signed a naturalization treaty with Bavaria. At the time, Bancroft was also accredited to Prussia and the North German Confederation and, after 1871, to the German Empire. Yet, although Bancroft was recalled from his position in Berlin in 1874 (at his own request), he was never officially recalled from the court of Bavaria. In 1895, four years after his death, Bancroft still “officially stood as the diplomatic representative of the United States to Bavaria.” (See entry on German Unification for greater details.) ",
  "belarus ": " Diplomatic relations were established on December 25, 1991, when President George H.W. Bush announced the decision in an address to the nation regarding the dissolution of the Soviet Union. ",
  "belgium": " Diplomatic relations were established on June 18, 1832, when Baron D. Behr, Minister of Belgium, sent a note attaching his “full powers” to Secretary of State Edward Livingston.",
  "belize ": " Diplomatic relations and the American Embassy were established on October 29, 1981, when Consulate General Belize was raised to Embassy status with Principal Officer Malcolm R. Barnebey serving as Chargé d’Affaires ad interim. ",
  "benin ": " Diplomatic relations were established on August 1, 1960, when Donald R. Norland took up his position as Chargé d’Affaires ad interim. He had presented his credentials on July 31, 1960, to take effect on the next day. ",
  "bolivia ": " Diplomatic relations were established on January 3, 1849, when American Chargé d’Affaires John Appleton presented his credentials to the Government of the Republic of Bolivia. ",
  "bosnia-herzegovina ": " Diplomatic relations were established on August 6, 1992, when President George H.W. Bush announced the decision during remarks to the press. ",
  "botswana ": " Diplomatic relations were established on September 30, 1966, when the American Embassy at Gaberones (Gaborone) was established with Charles H. Pletcher as Chargé d’Affaires ad interim. ",
  "brazil ": " The United States established relations with the Kingdom of Brazil on May 26, 1824, when President James Monroe received José Silvestre Rebello, as Brazil’s Chargé d’Affaires to the United States. On March 9, 1825, President Monroe appointed Condy Raguet of Pennsylvania as Chargé d’Affaires to Brazil. ",
  "brunei ": " Diplomatic relations and the American Embassy in Brunei were established on May 28, 1984, when U.S. Ambassador Barrington King presented credentials to the government at Bandar Seri Begawan. ",
  "brunswick-luneburg ": " The United States and the Duchy of Brunswick and Lüneburg never established diplomatic relations. ",
  "bulgaria ": " The first U.S. diplomatic representative in Bulgaria was Charles M. Dickinson, who was appointed Agent on April 24, 1901. He held the position until June 30, 1903. Dickinson served concurrently as Consul General at Constantinople, and there is no record that he ever presented credentials in Sofia. John B. Jackson, who was Minister to Greece, Romania, and Serbia, was the first Diplomatic Agent to Bulgaria, and the first U.S. representative to present his credentials there, which he did on September 19, 1903. This date marks the establishment of diplomatic relations between Bulgaria and the United States. He was re-appointed in 1911 as Minister to Romania, Serbia, and Bulgaria. Later Diplomatic Agents to Bulgaria (1907-10) were also Ministers to Romania and Serbia. Only one of them, Horace G. Knowles (1907-09) presented his credentials in Bulgaria. Only after World War I was a U.S. representative commissioned solely to Bulgaria. ",
  "burkina-faso ": " Diplomatic relations were established on August 5, 1960, when Donald R. Norland assumed his post as Chargé d’Affaires ad interim. Norland had presented his credentials on August 4, 1960, to take effect the following day. ",
  "burma ": " Diplomatic relations and the American Legation in Burma were established on September 18, 1947, when the U.S. Department of State announced that the governments of Burma and the United States had “agreed to exchange representatives with the rank of ambassador.” The announcement also stated that the Consulate General of the United States in Rangoon was being raised to the status of Embassy. ",
  "burundi ": " Embassy Usumbura (Bujumbura) was established July 1, 1962, with Herbert V. Olds as Chargé d’Affaires ad interim. The rank of the mission was changed to Legation effective December 15, 1962, and to Embassy again effective September 16, 1963. ",
  "cambodia ": " Diplomatic relations were established on July 11, 1950, when American Envoy Extraordinary and Minister Plenipotentiary Donald R. Heath presented his credentials to the government of the Kingdom of Cambodia. Heath was resident at Saigon. ",
  "cameroon ": " Diplomatic relations and the American Embassy in Cameroon were established on January 1, 1960, when the Consulate General at Yaounde was elevated to Embassy status, with Bolard More as Chargé d’Affaires ad interim. ",
  "canada ": " Diplomatic relations were established on February 18, 1927, when Vincent Massey presented his credentials in Washington as Canadian Envoy Extraordinary and Minister Plenipotentiary. ",
  "cape-verde ": " Diplomatic relations were established on July 19, 1975, when Ambassador of the Republic of Cape Verde Raul Querido Varela presented his credentials to President Gerald R. Ford. ",
  "cayman-islands": "",
  "central-african-republic ": " Diplomatic relations were established on August 13, 1960, when the American Consul at Brazzaville, Alan W. Lukens, presented his letter of credence as Charge d’Affaires. ",
  "central-american-federation ": " Diplomatic relations between the United States and the Federation of the Centre of America were established when U.S. President James Monroe received Antonio Jose Cañas as Envoy Extraordinary and Minister Plenipotentiary of the Federation of the Centre of America on August 4, 1824. ",
  "chad ": " Diplomatic relations were established on August 11, 1960, when the American Consul at Brazzaville, Alan W. Lukens, presented his credentials as Charge d’Affaires. ",
  "chile ": "S. Legation, 1824. The United States established diplomatic relations with Chile when Envoy Extraordinary and Minister Plenipotentiary Heman Allen of Vermont presented his credentials to Ramón Freire Serrano, who had replaced Bernardo O’Higgins as Supreme Director, on April 23, 1824. ",
  "china ": " Diplomatic relations were first established on or about June 16, 1844, when Caleb Cushing presented his credentials as Envoy Extraordinary and Minister Plenipotentiary and Commissioner to the Chinese authorities in Macao. He concluded the Treaty of Wangxia (Wang-hsia) on July 3, 1844, after which the United States maintained diplomatic representation in China at Guangzhou. ",
  "colombia ": " Diplomatic relations were established in 1822 by President Monroe’s reception of Colombian Chargé Manuel Torres. ",
  "comoros ": " Diplomatic relations were established on August 15, 1977, when United States and the Comorian Republic issued a joint communiqué that announced the establishment of diplomatic relations between the two countries. The first American Charge d’Affaires ad interim to the Republic of the Comoros, Robert S. Barrett IV, presented his credentials to Foreign Minister Mouzawior Abdallah on August 16, 1977. Barrett was also Charge d’Affairs ad interim and resident at Antananarivo, Madagascar. ",
  "congo-democratic-republic ": " Diplomatic relations were established on June 30, 1960, when the American Embassy in Leopoldville (now Kinshasha) was established with John D. Tomlinson as Chargé d’Affaires ad interim. ",
  "congo-free-state ": " ",
  "congo-republic ": " Diplomatic relations were established on August 15, 1960, when Embassy Brazzaville was established with Alan W. Lukens as Chargé d’Affaires ad interim. ",
  "costa-rica ": " Diplomatic relations were established on March 24, 1851, when Costa Rican Minister Felipe Molina presented his credentials in Washington. He served until his death on February 1, 1855. ",
  "cote-divoire ": " Diplomatic relations were established on August 7, 1960, when the American consulate at Abidjan was elevated to Embassy status with former consul Donald R. Norland as Charge d’Affaires. ",
  "croatia ": " Diplomatic relations were established on August 6, 1992, when President George H.W. Bush announced the decision during remarks to the press. ",
  "cuba ": " Diplomatic relations and the U.S. Legation in Havana were established on May 27, 1902, when U.S. Envoy Extraordinary and Minister Plenipotentiary Herbert Goldsmith Squiers presented his credentials to the Government of the Republic of Cuba. ",
  "cyprus ": " Diplomatic relations and the American Embassy in Nicosia were established on August 16, 1960, when the American Consulate General was elevated to an embassy, with L. Douglas Heck as Chargé d’Affaires ad interim. Ambassador Fraser Wilkins presented his credentials on September 19, 1960. ",
  "czech-republic ": " The Czech and Slovak Federal Republic (CSFR) ceased to exist on December 31, 1992, an event commonly referred to as the ‘Velvet Divorce.’ The United States established diplomatic relations with Czechia on January 1, 1993. ",
  "czechoslovakia ": " On November 12, 1918, Assistant Secretary of State William Phillips announced that the United States recognized Charles Pergler as the Czecho-Slovak National Council’s Commissioner in Washington. ",
  "denmark ": " Diplomatic relations were established on October 12, 1801, when the Danish Minister Resident to the United States presented his credentials to the U.S. government. ",
  "djibouti ": " Diplomatic relations were established on June 27, 1977, when the American Consulate General to the former French Territory of Afars and Issas became the American Embassy at Djibouti, with Walter S. Clarke as Chargé d’Affaires ad interim. ",
  "dominica ": " Ambassador Sally Angela Shelton presented credentials at Bridgetown, Barbados, where she remained resident. ",
  "dominican-republic ": " Diplomatic relations were established on March 26, 1884, when John M. Langston presented his credentials as American Charge d’Affaires to the Government of the Dominican Republic. He was also accredited to Haiti and resident at Port-au-Prince. ",
  "ecuador ": " The United States established diplomatic relations with Ecuador on August 12, 1848, when Chargé d’Affaires Van Brugh Livingston presented his credentials to the Ecuadorian Government. He became the first resident U.S. diplomatic agent in Ecuador. ",
  "egypt ": " Diplomatic relations were established on April 26, 1922, upon American recognition of Egyptian independence. American Diplomatic Agent and Consul General at Cairo, J. Morton Howell, had conducted unofficial relations with Egypt as a “semi-independent state” prior to this date, as had been U.S. practice since 1849. Upon recognition, Howell served as the American diplomatic representative to Egypt, and the position of Diplomatic Agent was raised to the rank of Envoy Extraordinary and Minister Plenipotentiary on June 24, 1922, thereby establishing the American Legation in Egypt. ",
  "el-salvador ": " Diplomatic relations were established on June 15, 1863, when James R. Partridge presented his credentials in San Salvador as U.S. Envoy Extraordinary and Minister Plenipotentiary. ",
  "equatorial-guinea ": " Diplomatic relations were established on November 21, 1968, when Ambassador Albert W. Sherer presented his credentials to the government of Equatorial Guinea. Sherer also was accredited to Togo and was resident at Lomé. ",
  "eritrea ": "S. Recognition of Eritrean Independence, 1993. Diplomatic relations were established on June 11, 1993, when the American consulate at Asmara was raised to Embassy status with Joseph P. O’Neill as Chargé d’Affaires ad interim. ",
  "estonia ": " Diplomatic relations were established on July 28, 1922, when U.S. Commissioner at Riga, Evan Young, informed the Foreign Office of Estonia that the United States recognized its independence and that he would continue as the American representative to the three Baltic States, with the new rank of Minister. ",
  "ethiopia ": " Diplomatic relations were established on December 27, 1903, when King of Ethiopia Menelik II and U.S. representative Robert P. Skinner signed a treaty of commerce in which the two states agreed to receive representatives “in order to perpetuate and strengthen the friendly relations which exist between Ethiopia and the United States of America.” ",
  "federal-government-germany ": " On August 9, 1848, U.S. Minister to Prussia Andrew J. Donelson was commissioned as the new U.S. Minister to the Federal Government of Germany, reflecting the developments of that revolutionary year. Donelson presented his credentials on September 13, 1848. ",
  "fiji ": " Diplomatic relations were established on July 22, 1971, when Ambassador of Fiji, Semesa K. Sikivou, presented his credentials to President Richard M. Nixon. ",
  "finland ": " The United States established diplomatic relations with Finland on May 27, 1919, when Acting Secretary of State Frank L. Polk recognized Armas Herman Saastamoinen as provisional Envoy Extraordinary and Minister Plenipotentiary of the de facto Government of Finland as U.S. President Woodrow Wilson was still in Europe for the Paris Peace Conference. Saastamoinen was recognized as Envoy Extraordinary and Minister Plenipotentiary on August 21, 1919, upon the return of President Wilson. ",
  "france": " Diplomatic relations were established on August 6, 1778, when Conrad Alexandre Gérard, presented to Congress his credentials as France’s Minister-Plenipotentiary and Consul-General. Benjamin Franklin was appointed as the first U.S. Minister Plenipotentiary to France on September 14, 1778, and was accredited by the French Government on March 23, 1779.",
  "gabon ": " Diplomatic relations were established on August 17, 1960, when Alan W. Lukens (resident at Brazzaville) presented his credentials as Chargé d’Affaires ad interim. ",
  "gambia": " Diplomatic relations were established on August 9, 1965, when Ambassador Mercer Cook presented his credentials to Gambian authorities. Cook also was accredited to Senegal and was resident at Dakar.",
  "genoa ": " The Republic of Genoa and the United States never established diplomatic relations. ",
  "georgia": " The American Embassy in T’bilisi was established April 23, 1992, with Carey Cavanaugh as Chargé d’Affaires ad interim.",
  "german-democratic-republic ": " The American Embassy in Berlin was established on December 9, 1974, with Brandon H. Grove, Jr., as Chargé d’Affaires ad interim. John Sherman Cooper presented his credentials as the first U.S. Ambassador to the GDR on December 20, 1974. ",
  "germany ": " On June 1, 1797, John Quincy Adams (the former U.S. Minister to the Netherlands and current Minister to Portugal) was nominated by U.S. President John Adams to serve as the Minister to Prussia. According to his instructions from the President, Adams’ task in Berlin was to renew the aforementioned 1785 Treaty of Amity and Commerce, which had expired in 1796. Unfortunately, Adams’ letters of credence had been addressed to King Frederick William II, who had died on November 16, 1797, before Adams could have an audience with him. During a private audience on December 5, however, the new king, Frederick William III, formally recognized Adams as the accredited U.S. Minister to his father. ",
  "ghana ": " Diplomatic relations and the American Embassy in Ghana were established on March 6, 1957, when the Consulate General at Accra was elevated to Embassy status, with Consul General Donald W. Lamm as Chargé d’Affaires ad interim. ",
  "grand-duchy-tuscany ": " The Grand Duchy of Tuscany and the United States never established diplomatic relations. ",
  "greece ": " On March 11, 1868, the United States appointed Charles K. Tuckerman as its first Minister Resident in Athens. He presented his credentials on June 16, 1868. ",
  "grenada ": " Diplomatic relations were established on November 29, 1974, when Grenadian Ambassador Marie J. McIntyre presented her credentials to President Gerald R. Ford. ",
  "guatemala ": " Diplomatic relations were established on August 4, 1824, when President James Monroe received Antonio José Cañaz as Envoy Extraordinary and Minister Plenipotentiary on August 4, 1824. ",
  "guinea ": " Diplomatic relations were established on February 13, 1959, when the American Embassy at Conakry was established with Robert W. Rinden as Chargé d’Affaires ad interim. ",
  "guinea-bissau": " Diplomatic relations were established on September 3, 1975, when Ambassador of Guinea-Bissau Gil Vicente Vaz Fernandes presented his credentials to President Gerald R. Ford.",
  "guyana ": " Diplomatic Relations and the American Embassy in Georgetown were established on May 26, 1966, with Delmar R. Carlson as Chargé d’Affaires ad interim. ",
  "haiti ": " Diplomatic relations and the American Legation in Port-au-Prince were established on October 1, 1862, when Commissioner and Consul General Benjamin F. Whidden presented his credentials to the Government of the Republic of Haiti. ",
  "hanover ": " Despite the fact that the Kings of Hanover, acting as Kings of Britain, had recognized the United States in 1783 with the signing of the peace treaty that ended the war between Britain and the United States, the U.S. never officially established diplomatic relations with the Kingdom of Hanover. ",
  "hanseatic-republics ": " The United States established diplomatic relations with the Hanseatic Republics in October 1853 when it received Rudolph Schleiden as Minister Resident of the Hanseatic Legation in Washington D.C ",
  "hawaii ": " David L. Gregg presented his credentials as U.S. Commissioner to the Kingdom of Hawaii on December 20, 1853. Gregg referred to the Mission at Honolulu as a Legation in his first dispatch from Hawaii on December 27, 1853. ",
  "hesse ": " The relations between the United States and the Grand Duchy of Hesse continued to expand through the 1860s. On August 1, 1868, specially accredited U.S. Minister Plenipotentiary George Bancroft signed a naturalization treaty with Hesse. At the time, Bancroft was also accredited to Prussia and the North German Confederation and, after 1871, to the German Empire. Yet, although Bancroft was recalled from his position in Berlin in 1874 (at his own request), he was never officially recalled from the court of Hesse. (See entry on German Unification.) ",
  "holy-see ": " The United States and the Holy See established diplomatic relations by agreement between President Ronald Reagan and Pope John Paul II on January 10, 1984. ",
  "honduras ": " Diplomatic relations were established on April 19, 1853, when American Envoy Extraordinary and Minister Plenipotentiary Solon Borland was appointed to Honduras, Costa Rica, Nicaragua, and El Salvador. Borland did not present his credentials in Tegucigalpa, though he was accredited to Honduras. ",
  "hungary ": " The United States and Hungary signed a treaty establishing friendly relations on August 29, 1921. It entered into force on December 17. ",
  "iceland ": " Diplomatic relations and the American Legation at Reykjavik were established on September 30, 1941, when Envoy Extraordinary and Minister Plenipotentiary Lincoln MacVeagh presented credentials and elevated the American Consulate to Legation status. Iceland had taken over full control of its foreign relations on April 10, 1940, although the country had not yet declared itself independent from Denmark, which was then under German occupation. ",
  "india ": " Diplomatic relations and the American Embassy at New Delhi were established on November 1, 1946, when the U.S. Department of State raised the American Mission at New Delhi to an Embassy. The U.S. Department of State announced on October 22, 1946, that the Governments of India and the United States had “agreed to an exchange of ambassadors and to the raising of their respective missions…to the rank of embassies.” ",
  "indonesia ": " Diplomatic relations were established on December 28, 1949, when U.S. Ambassador H. Merle Cochran presented his credentials to President Sukarno. Ambassador Cochran had previously been the U.S. representative to the United Nations Commission for Indonesia. ",
  "iran ": " Diplomatic relations and the American Legation at Tehran were established on June 11, 1883, when Chargé d’Affaires S.G.W. Benjamin presented his credentials to the Shah of Persia. ",
  "iraq ": " Diplomatic relations and the American Legation in Iraq were established on March 30, 1931, when Alexander K. Sloan (then serving as Consul in Iraq) was appointed Chargé d’Affaires of the American Legation at Baghdad. ",
  "ireland ": " Diplomatic relations were established on October 7, 1924, when Timothy A. Smiddy presented his credentials as Minister Plenipotentiary of the Irish Free State in Washington. ",
  "israel ": " Diplomatic Relations were established when U.S. Ambassador James Grover McDonald presented his credentials on March 28, 1949. ",
  "italy ": " The United States established diplomatic relations with the Kingdom of Italy in 1861 when it accepted the credentials of Chevalier Joseph Bertinatti as Minister Plenipotentiary of the Kingdom of Italy on April 11, 1861. ",
  "jamaica ": " Diplomatic relations and the American Embassy at Kingston were established on August 16, 1962, with Irving G. Cheslaw as Chargé d’Affaires ad interim. ",
  "japan ": " The United States established additional Consulates in Japan: Kanagawa (1862); Nagasaki (1862); Hakodate (1865); Osaka (1868); Tokyo (1869); Yokohama (1897); Kobe (1902); Shimonoseki (1918); Yokkaichi (1918); Fukuoka (1950); Sapporo (1950). These dates reflect the earliest date at which a consul or consul general (as opposed to a vice consul, consular agent, or commercial agent) was either appointed to or arrived at each post. ",
  "jordan ": " Diplomatic relations and the American Legation in Jordan were established on February 18, 1949 when Wells Stabler presented his credentials as Chargé d’Affaires ad interim at Amman. ",
  "kazakhstan ": " Diplomatic relations were established on December 25, 1991, when President George H.W. Bush announced the decision in an address to the nation regarding the dissolution of the Soviet Union. ",
  "kenya ": " Diplomatic relations and the American Embassy at Nairobi were established on March 2, 1964, when U.S. Ambassador William Attwood presented his credentials to the Kenyan government. ",
  "kingdom-of-yugoslavia ": " Diplomatic relations between the U.S. and Serbia were established on November 10, 1882, when U.S. Consul General Eugene Schuyler presented his credentials to the government of Serbia. At this time, the American Legation in Belgrade was established, though Schuyler was resident at Athens. ",
  "kiribati ": " The United States and Kiribati agreed to establish diplomatic relations on August 12, 1980. ",
  "korea": " Diplomatic relations and the American Legation at Seoul were established on May 20, 1883, when Envoy Extraordinary and Minister Plenipotentiary Lucius H. Foote presented his credentials to the King of Korea.",
  "korea-south ": " Diplomatic relations between the United States and the Republic of Korea (South Korea) were established on March 25, 1949, when Ambassador Dr. John Myun Chang, presented his credentials to President Truman. ",
  "kosovo": " The United States recognized Kosovo’s independence and agreed to establish diplomatic relations on February 18, 2008, when Secretary of State Condoleezza Rice released a press statement announcing President George W. Bush’s decisions.",
  "kuwait ": " Diplomatic relations were established on September 22, 1961, by agreement between the governments of both states. The American Embassy in Kuwait was established on the same date when the American consul in Kuwait, Dayton Mak, was designated Chargé d’Affaires. ",
  "kyrgyzstan ": " Diplomatic relations were established on December 25, 1991, when President George H.W. Bush announced the decision in an address to the nation regarding the dissolution of the Soviet Union. ",
  "laos ": " Diplomatic relations were established on July 29, 1950, when American Envoy Extraordinary and Minister Plenipotentiary Donald R. Heath presented his credentials to the King of Laos. Heath was also accredited to Cambodia and Viet-Nam and was resident at Saigon. ",
  "latvia ": " Diplomatic relations were established on July 28, 1922, when U.S. Commissioner at Riga, Evan Young, informed the Foreign Office of Latvia that the United States’ recognized its independence and that he would continue as the American representative to the three Baltic States, with the new rank of Minister. ",
  "lebanon ": " The United States established diplomatic relations with Lebanon when George Wadsworth presented his credentials as Envoy Extraordinary and Minister Plenipotentiary on November 16, 1944. Wadsworth had been serving as Diplomatic Agent and Consul General to Syria and Lebanon while the United States considered them to be “semi-independent” states. ",
  "lesotho ": " Diplomatic relations were established on October 4, 1966, when the American Embassy at Maseru was established with Richard St. F. Post as Chargé d’Affaires ad interim. ",
  "lew-chew ": " The United States and the Kingdom of Lew Chew never established diplomatic relations. ",
  "liberia ": " Diplomatic relations and the American Legation at Monrovia were established on February 23, 1864, when American Commissioner and Consul General Abraham Hanson presented his credentials to the Liberian government. ",
  "libya ": " Diplomatic relations and the American Legation in Libya were established on December 24, 1951, when the American Consulate General was elevated to a Legation with Andrew Lynch designated as Charge d’Affaires ad interim. ",
  "liechtenstein": " On February 10, 1997, U.S. Ambassador to Switzerland Madeleine M. Kunin was the first U.S. Ambassador accredited to Liechtenstein, resident at Bern.",
  "lithuania ": " Diplomatic relations were established on July 28, 1922, when U.S. Commissioner at Riga, Evan Young, informed the Foreign Office of Lithuania that the United States’ recognized its independence and that he would continue as the American representative to the three Baltic States, with the new rank of Minister. ",
  "luxembourg": " On July 17, 1903, U.S. Ambassador to the Netherlands Stanford Newel presented his credentials as Envoy Extraordinary and Minister Plenipotentiary to Luxembourg. He remained resident at the The Hague.",
  "macedonia": "S. Mission (or Liaison Office) in Skopje, 1993. The United States established a Liaison Office in Skopje on December 3, 1993. Robert L. Norman was the Acting Principal Officer.",
  "madagascar ": "S. Consulate to Embassy and Establishment of Diplomatic Relations, 1960. With the establishment of the independent Malagasy Republic, the American Consulate at Tananarive (now Antananarivo) was elevated to Embassy status on June 25, 1960 with former Consul J. Roland Jacobs as Charge d’Affaires ad interim. ",
  "malawi ": " Diplomatic relations were established on July 6, 1964, when the American consulate at Blantyre was elevated to Embassy status (designated as Zomba, Malawi until 1970, but physically at Blantyre) with Edward W. Holmes as Chargé d’Affaires ad interim. ",
  "malaysia ": " Diplomatic relations were established on August 31, 1957, when the United States elevated its Consulate General in Kuala Lumpur to the status of Embassy. Then Consul General Thomas K. Wright was placed in charge of the Embassy as Charge d’Affaires. ",
  "maldives": " On April 9, 1966, U.S. Ambassador to Ceylon Cecil B. Lyon presented his credentials to the Maldives; he remained resident at Colombo.",
  "mali ": "S. Recognition of the Republic of Mali, 1960. The United States recognized the Republic of Mali on September 24, 1960, when the American Consul at Bamako John Gunther Dean so informed the Malian government according to instructions from the Department of State. The Republic of Senegal had withdrawn from the Federation of Mali on August 20, 1960, and on September 22, 1960, the National Assembly of the Republic of Soudan legislated that it would become the Republic of Mali. ",
  "malta ": " The Embassy in Valletta was established on September 21, 1964, with Harrison Lewis as Chargé d’Affaires ad interim. The first U.S. Ambassador to Malta, George J. Feldman, presented his credentials on October 5, 1965. ",
  "marshall-islands": "S. Representative in Majurio, 1986. Prior to the establishment of diplomatic relations, and Office of the U.S. Representative in Majurio opened on October 21, 1986, under Samuel B. Thomsen.",
  "mauritania ": " Diplomatic relations were established on November 28, 1960, when Ambassador Henry S. Villard presented his credentials to Prime Minister Daddah. American Ambassadors to Mauritania also were accredited to Senegal, and were resident at Dakar. ",
  "mauritius ": " Diplomatic relations were established on March 12, 1968, when the American Embassy at Port Louis was established with William B. Hussey as Chargé d’Affaires at interim. ",
  "mecklenburg-schwerin ": " The United States and the Grand Duchy of Mecklenburg-Schwerin never established diplomatic relations. ",
  "mecklenburg-strelitz ": " The United States and the Grand Duchy of Mecklenburg-Strelitz never established diplomatic relations. ",
  "mexico ": " Diplomatic relations were established on December 12, 1822, when President James Monroe received José Manuel Zozaya as Mexican Minister to the United States. ",
  "micronesia ": " On November 3, 1986, the United States opened an Office of the U.S. Representative. Michael G. Wygant presented his credentials on October 2, 1987. ",
  "moldova ": " Diplomatic relations were established when President George H.W. Bush and Moldovan President Mircea Snegur agreed to do so during a February 18, 1992 meeting at the White House. The Bush administration confirmed February 18 as the date relations were established in a statement issued the next day. ",
  "monaco ": " The United States and Monaco established full diplomatic relations on December 8, 2006, when the first Monégasque ambassador to the United States, Gilles Noghès, presented his letters of credence to President George W. Bush. U.S. Ambassador to Monaco Craig Stapleton presented his credentials to Prince Albert II on December 13, 2006. Stapleton was resident in Paris. ",
  "mongolia ": " The United States established diplomatic relations with Mongolia on January 27, 1987, when the United States and Mongolia issued a joint communiqué to that effect. ",
  "montenegro ": " Diplomatic relations were established on October 30, 1905, when John B. Jackson, U.S. Envoy Extraordinary and Minister Plenipotentiary, presented his credentials to Prince Nikola. Jackson and his successors resided in Athens, Greece and made annual visits to Cetinje, the Montenegrin capitol. ",
  "morocco ": " Diplomatic relations were established on March 8, 1905, when the American consulate at Tangier was elevated to the status of a legation, and Samuel Gummere was named American Minister Plenipotentiary, with a letter of credence dated March 21. Gummere presented his credentials on September 29, 1906. ",
  "mozambique ": " The United States and Mozambique established diplomatic relations on September 23, 1975, when Secretary of State Henry Kissinger and Foreign Minister Joachim Alberto Chissano initialed a joint communiqué. ",
  "namibia ": " Diplomatic relations were established on March 21, 1990, when the U.S. Liaison Office at Windhoek was elevated to Embassy status with Roger A. McGuire as Chargé d’Affaires ad interim. ",
  "nassau ": " The United States and the Duchy of Nassau never established diplomatic relations. ",
  "nauru ": " Diplomatic relations were established on October 24, 1976, when U.S. Ambassador to Australia Marshall Green presented his credentials to Nauru; he remained resident at Canberra. ",
  "nepal ": " Diplomatic relations were established on February 16, 1948, when Nepal established a Legation to the United States with Commanding General Kaiser Shum Shere Jung Bahadur Rana, as Envoy Extraordinary and Minister Plenipotentiary. The Minister also was Ambassador to Great Britain, and the entire Legation staff resided at the Nepalese Embassy in London. ",
  "netherlands ": " Diplomatic relations and the American Legation in The Hague were established on April 19, 1782, when U.S. Minister John Adams presented his credentials. ",
  "new-zealand ": " Diplomatic relations and the New Zealand Legation in Washington were established on February 16, 1942, when Walter Nash presented his credentials as Envoy Extraordinary and Minister Plenipotentiary to President Franklin Roosevelt. ",
  "nicaragua ": " The United States established diplomatic relations with the Federation of Central American States when President James Monroe received Antonio José Cañaz as Envoy Extraordinary and Minister Plenipotentiary on August 4, 1824. ",
  "niger ": " Diplomatic relations were established on August 3, 1960, when Donald R. Norland presented credentials as Chargé d’Affaires ad interim, August 2, 1960, to take effect the following day. ",
  "nigeria ": " Diplomatic relations were established on October 1, 1960, when the Nigerian Embassy in Washington opened with M. J. Garba as Charge d’Affaires ad interim. ",
  "north-german-confederation ": " The U.S. sent George Bancroft to serve as Minister of the North German Confederation, in addition to Bancroft’s 1867 commission as U.S. Minister to Prussia. On February 22, 1868, Bancroft concluded the Naturalization Convention with the North German Union to “regulate the citizenship of those persons who emigrate from the North German Confederation to the United States of America, and from the United States of America to the territory of the North German Confederation.” ",
  "north-german-union ": " The U.S. sent George Bancroft to serve as Minister of the North German Confederation, in addition to Bancroft’s 1867 commission as U.S. Minister to Prussia. On February 22, 1868, Bancroft concluded the Naturalization Convention with the North German Union to “regulate the citizenship of those persons who emigrate from the North German Confederation to the United States of America, and from the United States of America to the territory of the North German Confederation.” ",
  "norway ": " Diplomatic relations were established on October 30, 1905,when Secretary Root also stated in his recognition message to the Foreign Minister of Norway that the United States would recognize Christian Hauge as Norway’s Chargé d’Affaires. Hauge was promoted to Minister and presented his new credentials on April 25, 1906. ",
  "oldenburg ": " The United States and the Grand Duchy of Oldenburg never established diplomatic relations. ",
  "oman ": " Diplomatic Relations were established on April 17, 1972, when American Envoy Extraordinary and Minister Plenipotentiary William A. Stoltzfus, Jr. presented his credentials to the government of Oman. Stoltzfus was accredited to Bahrain, Kuwait, Qatar and the United Arab Emirates as well, and he was resident in Kuwait. ",
  "orange-free-state ": " The United States and the Orange Free State never established diplomatic relations. ",
  "pakistan ": " Diplomatic relations were established on August 15, 1947, when the U.S. Department of State established the American Embassy at Karachi with Charles W. Lewis, Jr., as Chargé d’Affaires ad interim. ",
  "palau ": " On December 6, 1996, U.S. Ambassador to the Philippines Thomas C. Hubbard was accredited to Palau; he remained resident at Manila. ",
  "panama ": " Diplomatic relations were established on November 13, 1903, when President Theodore Roosevelt accepted the credentials of Philippe Bunau-Varilla as Panama’s Minister to the Untied States. ",
  "papal-states ": " The United States established diplomatic relations with the Papal States when Jacob L. Martin was received in Rome on August 19, 1848, as the first U.S. Chargé d’Affaires Near the Papal States. Unfortunately, he died shortly thereafter, and Lewis Cass was accredited on November 19, 1849, as the new U.S. Chargé d’Affaires. On November 9, 1854, Cass presented his credentials as U.S. Minister Resident to the Pontifical States. ",
  "papua-new-guinea ": "S. Embassy in Papua New Guinea, 1975. Diplomatic relations were established on September 16, 1975, when the U.S. Consulate General at Port Moresby was elevated to the status of Embassy and opened with Ambassador-designate Mary S. Olmsted in charge. Subsequently, the Ambassador to Papua New Guinea has also been accredited to the Solomon Islands and Vanuatu, and the Ambassador has remained resident at Port Moresby. ",
  "paraguay ": " Diplomatic relations and the American Legation in Asuncion were established on November 26, 1861, when American Commissioner Charles A. Washburn presented his credentials to the Government of the Republic of Paraguay. ",
  "parma ": " On June 20, 1853, U.S. Secretary of State William L. Marcy addressed a note to Don Angel Calderón de la Barca, Minister Resident from Spain, stating that the President would receive him on the following day for the ceremony of presentation of his credentials as Envoy Extraordinary and Minister Plenipotentiary of the Duke of Parma. ",
  "peru ": " Diplomatic relations and the American Legation in Lima were established on May 21, 1827, when James Cooley presented his credentials as Chargé d’Affaires. ",
  "philippines ": " Diplomatic relations were established on July 4, 1946, when American Ambassador Paul V. McNutt presented his credentials. ",
  "piedmont-sardinia ": " The United States established full diplomatic relations with Piedmont-Sardinia on February 7, 1839, when United States accepted the credentials of Count August Avogadro de Collobiano as the first Chargé d’Affaires at Washington from the Kingdom of Piedmont-Sardinia. The United States established a legation to the Kingdom of Sardinia at Turin in 1840. The first U.S. Chargé d’Affaires to the Kingdom of Piedmont-Sardinia was Hezekiah Gold Rogers, who presented his credentials on September 15, 1840. ",
  "poland ": " Diplomatic relations and the American Legation in Warsaw were established on May 2, 1919, when Hugh S. Gibson, the first U.S. Minister to Poland, presented his credentials. ",
  "portugal ": " Diplomatic relations and the American Legation in Lisbon were established on May 13, 1791, when U.S. Minister to Portugal Col. David Humphreys presented his credentials. ",
  "qatar ": " Diplomatic relations were established on March 19, 1972, when American Envoy Extraordinary and Minister Plenipotentiary William A. Stoltzfus, Jr. presented his credentials to the government of the State of Qatar. Stoltzfus was also accredited to a number of other Persian Gulf states and he resided in Kuwait. ",
  "romania ": " Eugene Schuyler was the first U.S. diplomatic representative to Romania. He was appointed Diplomatic Agent and Consul General on June 11, 1880. The Romanian Foreign Ministry indicated on August 13 that it was willing to enter into provisional relations with the U.S. Legation. Schuyler delivered his credentials on December 14, 1880. He was promoted to Chargé d’Affaires and Consul General on December 21, 1880, and presented his new credentials on January 25, 1881. Schuyler was reaccredited when Romania became a kingdom, presenting his new credentials on May 16, 1881. ",
  "russia ": " Diplomatic relations were established formally on July 14, 1809, when Andrei Dashkov presented his credentials as Russian Chargé d’Affaires to President James Madison. The process of establishing diplomatic relations between the United States and Russia began in August 1807, when the American Minister at London, James Monroe, discussed with the Russian Special Envoy at London, Maksim Alopeus, the possibility of establishing diplomatic ties between the two states. In December 1807, Alopeus informed the new American Minister-Designate at London, William Pinkney, that Emperor Alexander I was prepared to send a Minister to the United States as soon as the American government determined the rank of Minister it would in turn send to Russia. On August 30, 1808, Emperor Alexander issued credentials for Andrei Dashkov as Chargé d’Affaires and Consul General at Philadelphia. Meanwhile, the U.S. Senate rejected President Thomas Jefferson’s nominee as U.S. Minister to Russia, and also rebuffed newly inaugurated President James Madison, when he nominated John Quincy Adams as Minister to Russia in March 1809. Madison later resubmitted Adams’ nomination and it won Senate confirmation on June 27, 1809. Soon after, the first accredited diplomatic representative between the United States and Russia took up his post when Chargé Dashkov presented his credentials to President Madison on July 14, 1809. ",
  "rwanda ": " Diplomatic relations were established on July 1, 1962, when the American Embassy at Kigali was established, with David J.S. Manbey as Chargé d’Affaires ad interim. ",
  "saint-kitts-nevis ": "S. Special Representative to Saint Kitts and Nevis Appointed, 1977. Frank V. Ortiz, Jr. was appointed United States Special Representative to the States of Antigua, Dominica, Saint Christopher-Nevis-Anguilla, St. Lucia, and Saint Vincent on September 1, 1977. The appointment was concurrent to his positions as Ambassador to Barbados and Grenada. ",
  "saint-lucia ": "S. Special Representative to Saint Lucia Appointed, 1977. Frank V. Oritz, Jr. was appointed United States Special Representative to the States of Antigua, Dominica, St. Christopher-Nevis-Anguilla, St. Lucia, and St. Vincent on September 1, 1977. The appointment was concurrent to his positions as Ambassador to Barbados and to Grenada. ",
  "saint-vincent-grenadines ": "S. Special Representative to Saint Vincent Appointed, 1977. Frank V. Oritz, Jr. was appointed United States Special Representative to the States of Antigua, Dominica, St. Christopher-Nevis-Anguilla, St. Lucia, and St. Vincent on September 1, 1977. The appointment was concurrent to his positions as Ambassador to Barbados and to Grenada. ",
  "samoa ": " The United States and Samoa established diplomatic relations when Ambassador Kenneth Franzheim II presented his credentials to the Government of Samoa at Apia on July 14, 1971. Since that time the U.S. Ambassador to Samoa has also been accredited to New Zealand, Fiji, and Tonga, and has remained resident at Wellington, New Zealand. ",
  "san-marino ": " The Government of San Marino, in a March 29, 1861 letter from the Regent Captains, offered U.S. President Lincoln honorary citizenship. On May 7, 1861, Lincoln responded, “Although your dominion is small, your State is nevertheless one of the most honored, in all history.” Although the United States had consular relations with San Marino dating to 1925, it did not accredit an Ambassador to the republic until 2006. Ambassador Ronald Spogli, who was also the U.S. Ambassador to Italy, presented his credentials to San Marino on March 8, 2007, and was resident in Rome. ",
  "sao-tome-and-principe ": " The United States and Sao Tome and Principe established diplomatic relations on February 14, 1976, when Ambassador Andrew L. Steigman presented his credentials to the government at Sao Tome. Steigman also was accredited to Gabon and was resident at Libreville. No mission has been established at Sao Tome. ",
  "saudi-arabia ": " Diplomatic relations were established on February 4, 1940, when Bert Fish presented his credentials as American Envoy Extraordinary and Minister Plenipotentiary. He also was accredited to Egypt and was resident at Cairo. ",
  "schaumburg-lippe ": " The United States and the Principality of Schaumburg-Lippe never established diplomatic relations. ",
  "senegal ": " Diplomatic relations were established with the Republic of Senegal on September 24, 1960, when the American Embassy at Dakar in the Republic of Senegal was established, with Roswell D. McClelland as Chargé d’Affaires ad interim. The Embassy at Dakar had been accredited previously to the Federation of Mali, which no longer existed (see Mali). ",
  "serbia ": " The republics of Serbia and Montenegro declared a new Federal Republic of Yugoslavia (FRY) in April 1992. On May 21, 1992, the U.S. announced that it would not recognize the Federal Republic of Yugoslavia as a successor state of the Socialist Federal Republic of Yugoslavia. U.S. Ambassador Warren Zimmerman was recalled from Belgrade, but the mission continued with a staff under the authority of a Chargé d’Affaires ad interim ",
  "seychelles ": " Diplomatic relations were established on July 1, 1976, when the American consulate at Victoria was elevated to Embassy status with Gregory Matson as Chargé d’Affaires ad interim. ",
  "sierra-leone ": " Diplomatic relations were established on April 27, 1961, when the American Consulate General at Freetown was elevated to Embassy status, with Herbert Reiner, Jr., as Chargé d’Affaires ad interim. ",
  "singapore ": " Diplomatic relations and the American Embassy were established on April 4, 1966, when the United States opened its embassy in Singapore under with Richard H. Donald as Chargé d’Affaires ad interim. ",
  "slovakia ": " Diplomatic relations and the U.S. Embassy in Bratislava were established on January 4, 1993, with the appointment of Paul Hacker as Chargé d’Affaires ad interim. The first U.S. Ambassador to Slovakia, Theodore E. Russell, presented his credentials on November 22, 1993. Resources Department of State Country Fact Sheet: Slovakia Department of State Country Information: Slovakia ",
  "slovenia ": " Diplomatic relations were established on August 6, 1992, when President George H.W. Bush announced the decision during remarks to the press. ",
  "solomon-islands ": " Diplomatic relations were established on October 9, 1978, when Mary S. Olmsted presented her credentials as Ambassador to the Solomon Islands. Olmstead also was accredited to Papua New Guinea and was resident at Port Moresby. ",
  "somalia ": "S. Embassy in Somalia, 1960. Diplomatic relations were established on July 1, 1960, when the U.S. Consulate General at Mogadiscio (now Mogadishu) was elevated to Embassy status, with Andrew G. Lynch as Chargé d’Affaires. ",
  "south-africa ": " On November 5, 1929, the Union of South Africa established its legation in Washington with the presentation of the credentials of Eric Hendrik Louw as Envoy Extraordinary and Minister Plenipotentiary of the Union of South Africa to the Government of the United States. ",
  "south-sudan ": " Following its declaration of independence, the United States established full diplomatic relations with the Republic of South Sudan, upgrading the U.S. Consulate General in Juba to a U.S. Embassy on July 9, 2011. The United States appointed Ambassador Barrie Walkley, the U.S. Consul General in Juba, to serve as Chargé d’Affaires pending the appointment of a U.S. Ambassador to Juba. Susan D. Page was confirmed as the Ambassador Designate to the Republic of South Sudan on October 18, 2011. ",
  "soviet-union": "",
  "spain ": " Future Chief Justice of the U.S. Supreme Court John Jay was appointed Minister Plenipotentiary on September 29, 1779, and proceeded to Madrid shortly thereafter. However, he was never formally received by the Spanish Court due to the intricacies of Spanish involvement in the war against Great Britain at the time. The Spanish did not officially establish diplomatic relations with the United States until the U.S. Chargé d’Affaires ad interim, William Carmichael, was officially received at the court in Madrid on February 20, 1783. ",
  "sri-lanka ": " Diplomatic relations were established on October 29, 1948, when the Embassy of Ceylon opened in Washington, D.C. with Sir Claude Corea as Ambassador Extraordinary and Plenipotentiary. ",
  "sudan ": " Diplomatic relations were established on February 15, 1956, when the United States Liaison Office at Khartoum was elevated to Embassy status, with Arthur E. Beach as Chargé d’Affaires. ",
  "suriname ": " The United States Diplomatic relations and the American Embassy in Paramaribo were established on November 25, 1975, with Robert L. Flanagin as Chargé d’Affaires ad interim. ",
  "swaziland ": " Diplomatic relations were established on September 6, 1968, when the American Embassy at Mbabane was established with Chris C. Pappas, Jr., as Chargé d’Affaires ad interim. ",
  "sweden ": " Diplomatic relations were established on April 29, 1818, when Jonathan Russell presented his credentials as American Minister Plenipotentiary to Sweden. Russell resided in Stockholm while he was minister at the court of Sweden and Norway (which were not then separate countries). ",
  "switzerland ": " Diplomatic relations and the American Legation in Switzerland were established on June 29, 1853, when Theodore S. Fay presented his credentials as U.S. Minister Resident in Switzerland. ",
  "syria ": " The United States established diplomatic relations with Syria when George Wadsworth presented his credentials as Envoy Extraordinary and Minister Plenipotentiary on November 17, 1944. Wadsworth had been serving as Diplomatic Agent and Consul General to Syria and Lebanon while the United States considered them to be “semi-independent” states. ",
  "tajikistan ": " Diplomatic relations were established on February 19, 1992, when President George H.W. Bush announced the decision in a press statement. ",
  "tanzania ": " Diplomatic relations were established on December 9, 1961, when the American consulate general at Dar es Salaam was raised to Embassy status with William R. Duggan as Chargé d’Affaires ad interim. ",
  "texas ": "S. Legation in Houston, 1837. Diplomatic relations began when the U.S. Secretary of State accepted the credentials of William Harris Wharton, Texan Minister to the United States, on March 6, 1837. Alcée La Branche, the appointed Chargé d’Affaires of the U.S. Legation in Houston, then functioning as the seat of government, presented his credentials sometime between October 23 and 27, 1837. ",
  "thailand ": " Diplomatic relations and the first U.S. Legation in Thailand (then Siam) were established on October 23, 1882, when John A. Halderman presented his credentials as Minister Resident and Consul General. ",
  "timor-leste ": " The United States and Timor-Leste (East Timor) established diplomatic relations on May 20, 2002, when the United States opened an Embassy in Dili. It opened under the leadership of Chargé d’Affaires Shari Villarossa. Grover Rees 3rd became the first U.S. Ambassador to Timor-Leste when he presented his credentials on December 10, 2002. ",
  "togo ": " Diplomatic relations were established on April 27, 1960, when the American consulate at Lomé was raised to Embassy status with Jesse M. MacKnight as Chargé d’Affaires ad interim. ",
  "tonga ": " Tonga became an independent and sovereign nation within the British Commonwealth on June 4, 1970. On October 4, 1972, the United States accredited its Ambassador to New Zealand, Fiji, and Western Samoa, Kenneth Franzheim II, to Tonga; however, Franzheim resigned from his post in Wellington before he presented his credentials to Tonga on November 6, 1972. He resigned as U.S. Ambassador to Tonga shortly thereafter in January 1973. ",
  "trinidad-and-tobago": " The United States established diplomatic relations with Trinidad and Tobago on August 31, 1962, when it recognized the island nation’s independence. That same day, the United States established the American Embassy in Port-of-Spain, with William H. Christensen as Chargé d’Affaires ad interim. The first U.S. Ambassador to Trinidad and Tobago was Robert G. Miner who presented his credentials on December 1, 1962.",
  "tunisia ": " Although the United States maintained a consular presence in Tunis from 1795, with interruptions, and a Tunisian envoy visited the United States from 1805-1806, no permanent diplomatic relations existed during the period prior to the French Protectorate. ",
  "turkey ": " Diplomatic relations and the American Legation at Constantinople (Istanbul) were established on September 13, 1831, when David Porter presented his credentials as Charges d’Affaires. ",
  "turkmenistan ": " Diplomatic relations were established on February 19, 1992, when President George H.W. Bush announced the decision in a press statement. ",
  "tuvalu ": " Diplomatic relations were established on May 10, 1979, when Ambassador Inoke Faletau presented his credentials to President Jimmy Carter. ",
  "two-sicilies ": " Although the first diplomatic interaction between the United States and the Kingdom of the Two Sicilies occurred with the reception of U.S. Special Minister Plenipotentiary to Naples William Pinkney in 1816, this did not result in the establishment of full diplomatic relations at the time. Pinkney was commissioned on April 23, 1816, with the mission to negotiate a treaty to pay reparations to U.S. merchants for items lost during the reign of Murat. Pinkney’s mission was unsuccessful, and in October 1816 he departed for his post at St. Petersburg, Russia. Full diplomatic relations were established when the first U.S. Chargé d’Affaires to the Kingdom of the Two Sicilies John Nelson presented his credentials to the King of the Two Sicilies on January 25, 1832. The first U.S. Minister Resident at Naples was Robert Dale Owen, who presented his credentials on September 20, 1854. On December 7, 1846, the Chevalier Rocco Martuscelli presented his credentials as the Chargé d’Affairs at Washington of the Kingdom of the Two Sicilies. From then until 1861 the Government of the Two Sicilies was almost continuously represented in the United States by a Chargé d’Affaires. The last of these representatives was Giuseppe Anfora dei Duchi di Liccignano, Consul General, who acted as Chargé d’Affaires ad interim from September 24, 1860, to December 15, 1861. "
